export const steps = [
  {
    title: '关键词研究',
    description: ['使用工具进行关键词研究', '了解用户意图和关键词类型'],
  },
  {
    title: '竞争分析',
    description: ['分析竞争对手的SEO策略', '获取竞争对手的关键词排名、反向链接等信息'],
  },
  {
    title: '内容优化',
    description: ['创建高质量原创且针对目标关键词优化的内容', '理解用户需求，找到用户行为，做出产品'],
  },
  {
    title: '技术优化',
    description: ['确保网站的技术基础对搜索引擎友好', '使用工具进行技术SEO审查'],
  },
  {
    title: '外链建设',
    description: ['获取来自权威网站的反向链接', '避免采用被搜索引擎视为操纵排名的链接建设策略'],
  },
  {
    title: '监控优化',
    description: ['使用工具监控网站的SEO表现', '根据数据调整SEO策略'],
  }
]